# <font color=green> **Challenge Pandas 01**

<font color=green> 01 - Importa el archivo alumnos.csv y almacena su contenido en un DataFrame de Pandas.

In [4]:
# Importacion de archivo gist alumnos.csv

import pandas as pd

url = 'https://gist.githubusercontent.com/ahcamachod/807a2c1cf6c19108b2b701ea1791ab45/raw/fb84f8b2d8917a89de26679eccdbc8f9c1d2e933/alumnos.csv'

datos = pd.read_csv(url)

<font color=green> 02 -  Visualiza las primeras 7 filas del DataFrame y las Ãºltimas 5.

In [5]:
# Validando las primeras filas del Dataframe
datos.head(7)

    Nombre  Edad  Nota Aprobado
0  Alberto    20   7.5     True
1      Ana    18   NaN    False
2   Camila    27   2.5    False
3    David    18   5.0    False
4    Brian    21  10.0     True
5    Bruna    23   NaN    False
6  Daniela    21   7.0     True

In [6]:
# Validando las ultimas filas del dataframe
datos.tail()

    Nombre  Edad  Nota   Aprobado
13  Miriam    25   9.0       True
14   Pablo    37   NaN      False
15  Milena    29   7.0       True
16   Lucas    33   NaN      False
17   Nadia    34   8.0  Verdadero

<font color=green> 03 - Verifica la cantidad de filas y columnas en este DataFrame.

In [7]:
# Validando la cantidad de filas y columnas en el Dataframe
datos.shape

(18, 4)

In [8]:
# Validando informacion adicional del dataframe con info
datos.info

<bound method DataFrame.info of       Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   NaN      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   NaN      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   NaN      False
10    Danilo    21   NaN      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   NaN      False
15    Milena    29   7.0       True
16     Lucas    33   NaN      False
17     Nadia    34   8.0  Verdadero>

<font color=green> 04 - Explora las columnas del DataFrame y analiza los tipos de datos presentes en cada columna.

In [9]:
# Visualizar los nombres de las columnas
datos.columns

Index(['Nombre', 'Edad', 'Nota', 'Aprobado'], dtype='object')

In [10]:
# Seleccionar una columna
datos['Nombre']

0      Alberto
1          Ana
2       Camila
3        David
4        Brian
5        Bruna
6      Daniela
7       Carlos
8       Alicia
9       Victor
10      Danilo
11     Ignacio
12    Stephany
13      Miriam
14       Pablo
15      Milena
16       Lucas
17       Nadia
Name: Nombre, dtype: object

In [11]:
# Seleccionar mÃºltiples columnas
datos[['Edad', 'Nota']]

    Edad  Nota
0     20   7.5
1     18   NaN
2     27   2.5
3     18   5.0
4     21  10.0
5     23   NaN
6     21   7.0
7     19   6.0
8     35   5.6
9     28   NaN
10    21   NaN
11    24   4.5
12    26  10.0
13    25   9.0
14    37   NaN
15    29   7.0
16    33   NaN
17    34   8.0

In [12]:
# Verificar los tipos de datos en cada columna
datos.dtypes

Nombre       object
Edad          int64
Nota        float64
Aprobado     object
dtype: object

<font color=green> Extra: Calcula algunas estadÃ­sticas descriptivas bÃ¡sicas de los datos en el DataFrame (media, desviaciÃ³n estÃ¡ndar, etc.). Pista: busca el mÃ©todo "describe".

In [13]:
datos.describe()

            Edad       Nota
count  18.000000  12.000000
mean   25.500000   6.841667
std     6.070662   2.264532
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000